(texto as text) as text =>
let
    repl = {
        {"á","a"},{"à","a"},{"â","a"},{"ã","a"},{"ä","a"},{"Á","A"},{"À","A"},{"Â","A"},{"Ã","A"},{"Ä","A"},
        {"é","e"},{"è","e"},{"ê","e"},{"ë","e"},{"É","E"},{"È","E"},{"Ê","E"},{"Ë","E"},
        {"í","i"},{"ì","i"},{"î","i"},{"ï","i"},{"Í","I"},{"Ì","I"},{"Î","I"},{"Ï","I"},
        {"ó","o"},{"ò","o"},{"ô","o"},{"õ","o"},{"ö","o"},{"Ó","O"},{"Ò","O"},{"Ô","O"},{"Õ","O"},{"Ö","O"},
        {"ú","u"},{"ù","u"},{"û","u"},{"ü","u"},{"Ú","U"},{"Ù","U"},{"Û","U"},{"Ü","U"},
        {"ç","c"},{"Ç","C"},{"ñ","n"},{"Ñ","N"}
    },
    saida = List.Accumulate(repl, texto, (state, current) => Text.Replace(state, current{0}, current{1}))
in
    saida